uhnp/src/Catalogs/УдалитьПанелиОтчетов/УдалитьПанелиОтчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УдалитьПанелиОтчетов</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НастройкиКомпоновщикаНастроек</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбщийОтбор</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодлежитПередачеВПодчиненныеУзлыПриОбменеПоОрганизации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаКомпоновкиДанныхХранилище</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ТолькоОбщийОтбор</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьНаименование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкиПоУмолчанию</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимМоделирования</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отбор</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>УниверсальныйОтчет</name>
      <type>
        <types>CatalogRef.БланкиОтчетов</types>
        <types>CatalogRef.ПроизвольныеОтчеты</types>
        <types>EnumRef.ВидыРасшифровокПоказателяМКП</types>
      </type>
    </attributes>
    <attributes>
      <name>НастройкиОтчета</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторКолонки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СохраненнаяНастройка</name>
      <type>
        <types>CatalogRef.СохраненныеНастройки</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьНаименование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПараметрыОтчета</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровываемыйОтчет</name>
      <type>
        <types>CatalogRef.ПроизвольныеОтчеты</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеМонитора</name>
      <comment>Отображение монитора ключевых показателей</comment>
      <type>
        <types>EnumRef.СпособОтображенияМонитораКлючевыхПоказателей</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторОбласти</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>РасшифровываемаяОбласть</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПериодовДляОтображения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>2</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображениеРасшифровки</name>
      <type>
        <types>EnumRef.ОтображениеРасшифровки</types>
      </type>
    </attributes>
    <attributes>
      <name>Параметры</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоКолонокВиджетов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьЛоготипПоказателей</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Режим</name>
      <type>
        <types>EnumRef.РежимыАналитическихОтчетов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВариантРазмещенияЛегендыДиаграммы</name>
      <type>
        <types>EnumRef.ВариантыРазмещенияЛегендыДиаграммы</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСтолбцовДиаграммы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипОбластиДиаграммы</name>
      <type>
        <types>EnumRef.ТипыДиаграмм</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьЗаголовокПринадлежностиЗависимойОбласти</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>СкрыватьЗаголовокПоказателяЗависимойОбласти</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ГруппыОтчетов</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьНаименование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтраницы</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СтраницыПанели</name>
    <attributes>
      <name>Использование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПорядковыйНомер</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОтображатьНаименование</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГруппировкаПанелей</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РасшифровкиМонитораКлючевыхПоказателей</name>
    <attributes>
      <name>ОбластьМонитора</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбластьРасшифровки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерАналитики</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДиапазонПериодов</name>
      <comment>Число периодов для вывода динамики изменения показателя</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

uhnp/src/Enums/ВидыРасшифровокПоказателяМКП/ВидыРасшифровокПоказателяМКП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыРасшифровокПоказателяМКП</name>
  <enumValues>
    <name>СтруктураПоказателя</name>
  </enumValues>
  <enumValues>
    <name>ДинамикаПоказателя</name>
  </enumValues>
</mdclass:Enum>

uhnp/src/Catalogs/УдалитьПанелиОтчетов/Forms/НастройкаПодчиненностиОтчетов/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныйОтчет = Параметры.УниверсальныйОтчет;
	
	Если НЕ ЗначениеЗаполнено(УниверсальныйОтчет) Тогда
		
		Отказ = Истина;
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Для текущей области нельзя установить подчиненные области'"));
		Возврат;
		
	КонецЕсли;
	
	ТекущиеРасшифровки = УниверсальныйОтчет.Расшифровки.Получить();
	
	Если ТекущиеРасшифровки = Неопределено Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Для Каждого Элемент Из ТекущиеРасшифровки Цикл
		НоваяСтрока = НаборОтчетов.Добавить();
		НоваяСтрока.Отчет = Элемент.Отчет;
		НоваяСтрока.Использовать       = Истина;
	КонецЦикла;
	
	// Для МКП нужно добавить еще структуру и динамику показателей.
	Если УниверсальныйОтчет.ВидПроизвольногоОтчета = 1 Тогда
		
		НоваяСтрока = НаборОтчетов.Добавить();
		НоваяСтрока.Отчет = Перечисления.ВидыРасшифровокПоказателяМКП.ДинамикаПоказателя;
		НоваяСтрока.Использовать       = Истина;
		
		НоваяСтрока = НаборОтчетов.Добавить();
		НоваяСтрока.Отчет = Перечисления.ВидыРасшифровокПоказателяМКП.СтруктураПоказателя;
		НоваяСтрока.Использовать       = Истина;
	КонецЕсли;
	
	Если НаборОтчетов.Количество() = 0 Тогда
		
		ОбщегоНазначенияУХ.СообщитьОбОшибке(НСтр("ru = 'Для текущей области нет подчиненных отчетов'"));
		Отказ = Истина;
		Возврат;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОК(Команда)
	
	НайденныеСтроки = НаборОтчетов.НайтиСтроки(Новый Структура("Использовать", Истина));
	
	МассивОтвета = Новый Массив;
	Для Каждого Элемент Из НайденныеСтроки Цикл
		МассивОтвета.Добавить(Элемент.Отчет);
	КонецЦикла;
	
	Закрыть(МассивОтвета);
	
КонецПроцедуры


&НаКлиенте
Процедура УстановитьФлажки(Команда)
	
	Для Каждого Элемент ИЗ НаборОтчетов Цикл
		
		Элемент.Использовать = Истина;
		
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура СнятьФлажки(Команда)
	
	Для Каждого Элемент ИЗ НаборОтчетов Цикл
		
		Элемент.Использовать = Ложь;
		
	КонецЦикла;
	
КонецПроцедуры
